1. 读入10个成绩，判断由多少个不及格的
2. 读入输入的月份，判断属于哪一个季节
3. 读入用户输入的一个整型数，判断是否为质数
4. 读入一个用户输入的整型数，将这个整型数的第3位置1，将这个数的第5位清0，其他位不变
5. 打印乘法口诀
6. 求得Fibonacci数列的前10项(前两项位1，从第三项开始每一项是前两项的和)
7. 打印一下图形  
    *
  * * * 
* * * * *

* * * *
  * * * *
    * * * *
    
A
A B
A B C
A B C D
#include <stdio.h>
int main(void)
{
   //读入10个成绩，判断几个不及格
	int score[10];
	int c1=0,c2=0;
	int i;

	printf("请输入10个学生成绩：");
	scanf("%d", &score[i]);
	for(i = 0; i < 10; i++)
	{
		if(score[i] >= 60)
			c1++;
		else
			c2++;
	}
	printf("及格人数有%d个\n", c1); 
	return 0;
}


